## Plan Result (user-list-search-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/99550)



<pre><code>Plan: 0 to add, 7 to change, 0 to destroy.</code></pre>

* Update
  * aws_lambda_function.item_delete_sqs_processor
  * aws_lambda_function.item_update_backfill_sqs_processor
  * aws_lambda_function.item_update_sqs_processor
  * aws_lambda_function.unified_events_consumer
  * aws_lambda_function.user_list_events_sqs_processor
  * aws_lambda_function.user_list_import_backfill_sqs_processor
  * aws_lambda_function.user_list_import_sqs_processor



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_lambda_function.item_delete_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "item_delete_sqs_processor" {
        id                             = "UserListSearch-Prod-ItemDelete"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-ItemDelete:296" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-ItemDelete:296/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
      ~ version                        = "296" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "GIT_SHA"                   = "610d31969a5a7b765ac66bfdaddd1b703598c59e" -> null
                # (6 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.item_update_backfill_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "item_update_backfill_sqs_processor" {
        id                             = "UserListSearch-Prod-ItemUpdateBackfill"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-ItemUpdateBackfill:385" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-ItemUpdateBackfill:385/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
      ~ version                        = "385" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "GIT_SHA"                   = "610d31969a5a7b765ac66bfdaddd1b703598c59e" -> null
                # (7 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.item_update_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "item_update_sqs_processor" {
        id                             = "UserListSearch-Prod-ItemUpdate"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-ItemUpdate:390" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-ItemUpdate:390/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
      ~ version                        = "390" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "GIT_SHA"                   = "610d31969a5a7b765ac66bfdaddd1b703598c59e" -> null
                # (6 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.unified_events_consumer will be updated in-place
  ~ resource "aws_lambda_function" "unified_events_consumer" {
        id                             = "UserListSearch-Prod-UnifiedEventsConsumer"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UnifiedEventsConsumer:425" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UnifiedEventsConsumer:425/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
      ~ version                        = "425" -> (known after apply)
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "GIT_SHA"                   = "610d31969a5a7b765ac66bfdaddd1b703598c59e" -> null
                # (6 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.user_list_events_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "user_list_events_sqs_processor" {
        id                             = "UserListSearch-Prod-EventHandler"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-EventHandler:165" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-EventHandler:165/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
      ~ version                        = "165" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "GIT_SHA"                   = "610d31969a5a7b765ac66bfdaddd1b703598c59e" -> null
                # (6 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.user_list_import_backfill_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "user_list_import_backfill_sqs_processor" {
        id                             = "UserListSearch-Prod-UserListImportBackfill"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UserListImportBackfill:384" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UserListImportBackfill:384/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
      ~ version                        = "384" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "GIT_SHA"                   = "610d31969a5a7b765ac66bfdaddd1b703598c59e" -> null
                # (7 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.user_list_import_sqs_processor will be updated in-place
  ~ resource "aws_lambda_function" "user_list_import_sqs_processor" {
        id                             = "UserListSearch-Prod-UserListImport"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UserListImport:382" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:996905175585:function:UserListSearch-Prod-UserListImport:382/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Prod"
            "service"     = "UserListSearch"
        }
      ~ version                        = "382" -> (known after apply)
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "GIT_SHA"                   = "610d31969a5a7b765ac66bfdaddd1b703598c59e" -> null
                # (6 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

Plan: 0 to add, 7 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"8db063f5-5c62-46ac-b40b-201083083a88","JobName":"user-list-search_infrastructure_plan_prod","PRNumber":333,"Program":"tfcmt","SHA1":"a7d4a9a651704ca416061b97190f672c5b812e48","Target":"user-list-search-cdk","Vars":{}} -->